tests/artillery/generate.yml
config:
  target: "http://0.0.0.0:5000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load
  variables:
    terms:
      - "10"
      - "100"
      - "300"
      - "10000"

scenarios:
  - name: "Homepage"
    flow:
      - get:
          url: "/"

  - name: "Generate numbers"
    flow:
      - get:
          url: "/api/fibonacci?terms={{ terms }}"

  - name: "Swagger interface"
    flow:
      - get:
          url: "/api/ui/"